Revit 2027 API
HostedSweep.VerticalFlip Method
Flip the hosted sweep object along vertical line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void VerticalFlip()
Public Sub VerticalFlip
public:
void VerticalFlip()
member VerticalFlip : unit -> unit
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace